
const team = [ 
    'John',
    'Valerchik',
    'Vovanchik',
    'Olezha',
    'Glebushka',
    'Messi'
];

for (let i = 0; i < team.length; i++ ) {
    if (team[i] === 'Messi') {
        team[i] = 'Evlampij';
    }
    // console.log(team);


}

// team[team.length] = 'Mitrofan';
// team[team.length] = 'Zhorik';

// console.log(team);

// console.log( team[team.length - 2] );


// let numbers = [2,31,2,4,5];

// const team2 = new Array(10);
// console.log(team2);


// console.log(team.length); 

// team[0] = 'Evlampij';
// team[3] = 'Evlampij';

// length нужно перезаписывать НИКОГДА!
// team.length = 3;

// const someArr = [];
// const userInput = 35;
// someArr.length = userInput;

// 1. дан массив 10 чисел. вывести в консоль сумму всех элементов массива
// 2. найти среднее арифметическое всех элементов массива, которые стоят 
// на четных местах (0,2,4...)
// 3. дан исходный массив [2,-65,7,-1,26,48,-93,58,9]
// создать новый массив, элементы которого противоположны по знакам исходного
// 4. создать пустой массив длиной 10
// автоматически заполнить массив нулями и единицами, начиная с единицы
// 5. заполнить массив последовательными нечетными числами (длина 10)
// 6. с помощью цикла создать массив, каждый элемент которого равен
// квадрату своего номера (длина 10)
// 7. дан массив 10 чисел. вывести в консоль количество четных
// элементов из этого массива
// 8. дан массив 10 чисел. вывести наибольшее число из этого массива 
// 9. дан массив из 10 случайных чисел (НЕ ПОСЛЕДОВАТЕЛЬНЫХ)
// найдите количество элементов массива, которые отличны от наибольшего 
// не больше чем на 10%
// 10. дан массив из 10 случайных чисел (НЕ ПОСЛЕДОВАТЕЛЬНЫХ)
// выведите на экран наибольший ЧЕТНЫЙ элемент массива
// 11. дан массив из 10 случайных чисел (НЕ ПОСЛЕДОВАТЕЛЬНЫХ)
// пользователь вводит число n, вывести в консоль элемент массива
// который наиболее близок к n (если таких элементов несколько, вывести несколько)

